// нопедекемхе йннпдхмюр жемрпю люяя рпесцнкэмхйю
int hm4TriangleCenter(double *P0, double *P1, double *P2, double *TC);

// бшвхякемхе окныюдх рпесцнкэмхйю
double hm4TriangleSquare(double *P1, double *P2, double *P3);

// нопедекемхе йннпдхмюр жемрпю люяя вершпеусцнкэмхйю
int hm4QuadCenter(double *P0, double *P1, double *P2, double *P3, double *QC);

// еярэ рпесцнкэмюъ цпюмэ мейнрнпнцн щкелемрю я хмдейянл iE
// мслепюжхъ бепьхм рпесцнкэмхйю - опнрхб вюянбни ярпекйх опх бгцкъде мю щкелемр "ямюпсфх"
// ондопнцпюллю бшвхякъер бейрнп окныюдх цпюмх face
// бейрнп окныюдх цпюмх - бейрнп бмеьмеи мнплюкх, рн еярэ, сякнбмн, хяундхр хг жемрпю люяя щкелемрю iE б
// мюопюбкемхх жемрпю люяя яняедмецн он пюяялюрпхбюелни цпюмх щкелемрю
int hm4TriangleFace(double *P0, double *P1, double *P2, double *face);

// еярэ вершпеусцнкэмюъ цпюмэ мейнрнпнцн щкелемрю я хмдейянл iE
// мслепюжхъ бепьхм вершпеусцнкэмхйю - опнрхб вюянбни ярпекйх опх бгцкъде мю щкелемр "ямюпсфх"
// ондопнцпюллю бшвхякъер бейрнп окныюдх цпюмх face
// бейрнп окныюдх цпюмх - бейрнп бмеьмеи мнплюкх, рн еярэ, сякнбмн, хяундхр хг жемрпю люяя щкелемрю iE б
// мюопюбкемхх жемрпю люяя яняедмецн он пюяялюрпхбюелни цпюмх щкелемрю
// !!!!!
// б дюммнл яксвюе бейрнп окныюдх бшвхякъеряъ он бейрнпмнлс опнхгбедемхч дхюцнмюкэмшу бейрнпнб
// врн асдер, еякх вершпе рнвйх ме кефюр б ндмни окняйнярх?
int hm4QuadFace(double *P0, double *P1, double *P2, double *P3, double *face);

// опюбюъ яхярелю йннпдхмюр, онярпнеммюъ он едхмхвмнлс бейрнпс бмеьмеи мнплюкх й цпюмх
int hm4FaceCoordinateSystem(double *n, double *s, double *t);

// хмхжхюкхгюжхъ вхякю (*fN) х яохяйю бепьхм vF[(*fN)] наыеи цпюмх щкелемрнб
// рхонб (он вхякс бепьхм) eL х eR ян яохяйюлх бепьхм evL[eL] х evR[eR], яннрберярбеммн
// хмдейяш бепьхм наыеи цпюмх оепевхякъчряъ б онпъдйе опнрхб вюянбни ярпекйх опх
// бмеьмел бгцкъде мю щкелемр eL
// опедонкюцюеряъ, врн дбю щкелемрю наъгюрекэмн хлечр наысч цпюмэ
// нрясрярбхе наыеи цпюмх рпюйрсеряъ ондопнцпюллни йюй ньхайю
int hm4ElementsSameFace(int eL, int *evL, int eR, int *evR, int *fN, int *vF);

// хмхжхюкхгюжхъ вхякю (*fN) х яохяйю бепьхм vF[(*fN)]
// дкъ цпюмх я мнлепнл indexFace щкелемрю рхою (он вхякс бепьхм) eL ян яохяйнл бепьхм evL[eL]
int hm4ElementFaceNodes(int eL, int *evL, int indexFace, int *fN, int *vF);
